Revit 2027 API
DefinitionGroups.Item Property
Retrieve a definition group by name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DefinitionGroup this[
	string groupName
] { get; }
Public ReadOnly Property Item (
	groupName As String
) As DefinitionGroup
	Get
public:
property DefinitionGroup^ Item[String^ groupName] {
	DefinitionGroup^ get (String^ groupName);
}
member Item : DefinitionGroup with get
Parameters
groupName String
The name of the group for which to search.
Property Value
DefinitionGroup
Remarks
If the group is not found then null will be returned.
See Also
Reference
DefinitionGroups Class
Autodesk.Revit.DB Namespace